# CurveNormal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTray..::..CurveNormal Property
CableTray Class See Also
---
The up-direction vector of the cable tray.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ CurveNormal { get; set; }
```

Visual Basic
---
```text
Public Property CurveNormal As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ CurveNormal {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
CableTray Class
Autodesk.Revit.DB.Electrical Namespace